// Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы 
// заменены на строчные.

string str = "AaBcdFG";
string str1 = str.ToLower();
Console.WriteLine (str1);